{
  "matchups": {
    "aatrox": {
      "id": 266,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Don't trade with Aatrox when he has his passive active. It has a very long cooldown, so whenever he uses, look to trade with him. Do your best to dodge his sweet spots or you will take a lot of damage. If you get hit by his W, you can E out of it, to the side and back. Don't fight him in his ult, unless you already have grevious wounds. He will outheal your damage.",
      "tips": [
        "Do not trade with Aatrox when it has his passive active. It has a very long cooldown. Trade when its down",
        "Do your best to dodge the sweet spots",
        "If you get hit by his W you can e out of it to the side and back",
        "Do not fight Aatrox in his ult, unless you have greivous he will outheal your damage"
      ],
      "summoners": [
        "Flash",
        "Ignite"
      ],
      "build_items": [
        "Mortal Reminder",
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "ahri": {
      "id": 103,
      "difficulty": 9,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Don't ever Q3 into her if she has charm up. You will take her full combo to the face and die. Do your best to dodge her Q poke early game, especially the return which is true damage. At level 6, it's harder to kill her because she's so mobile. Bait out her charm and then look for short trades or an all-in if you can. Never ult into her if she has her ult up, or she will just ult away and live.",
      "tips": [
        "Ahri's survival skills are considerably reduced when his ultimate skill, Spiritual assault, is not available.",
        "Stay behind the minions to prevent Charme from touching you easily. This greatly reduces Ahri's offensive potential."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "akali": {
      "id": 84,
      "difficulty": 8,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Akali is annoying because of her Q spam, shroud, and dashes. Never Q3 into her when she has E up, or she'll just dodge it; her E will chunk you and you'll be in kill range. Do your best to dodge her Q poke early game. A huge chunk of HP is not worth that one cs. Use your E before you have Q3 so you can hit her more easily. Early null-magic mantle is good especially if the lane is even.",
      "tips": [
        "When Akali is cloaked by Nebulous Shroud, she can still be hit by area effects. This momentarily reveals his position.",
        "Akali's Kunais Wave is powerful when used at maximum range and with maximum energy. Attack her when she has low energy left to increase your chances of winning your trades.",
        "Return to base if your HP is low and if Akali has her ultimate."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "akshan": {
      "id": 166,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Akshan is very oppressive early. You cannot fight him until you have zerks and vamp scepter. Play with the goal to scale and hit your item spikes. Do your best to farm without taking too much poke or you will be susceptible to ganks/dives. Don't stay in the wave because he will Q the wave, damaging you and pushing the wave at the same time. The more targets his Q hits, the further it will go.",
      "tips": [
        "play passive till vampire staff and berserkers, focus on farm"
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "anivia": {
      "id": 34,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Anivia is annoying, but this matchup is even. You HAVE to dodge her Q or you will take her combo and get chunked. Bait out her Q by E'ing and running to the side. You can also E forward when she walls you. Your E will go behind the wall; use this to escape a gank or with your life. At level 6, most anivias will just perma shove, so you can just play to scale and farm for your items.",
      "tips": [
        "Try to gank Anivia on a lane. With multiple people, it's easier to make sure her egg dies.",
        "If you're a ranged champion, staying far enough away from Anivia makes it easier to dodge Ice Spear.",
        "Try to fight Anivia in the lanes. In the jungle, she can block paths with Crystallization."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "annie": {
      "id": 1,
      "difficulty": 7,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Rush null-magic mantle in this matchup and she will never one-shot you with her combo. Use your W when she Qs you to mitigate some damage during the trade. She will look to harass you with her long range AAs. Look to all-in her as soon as she uses her stun passive. She will have no way to retalitate and will have to blow flash.",
      "tips": [
        "Annie's bear, Tibbers, burns enemies around him. Keep your distance when summoned.",
        "The summoner spell Smite can help bring down Tibbers.",
        "Be careful when a small white whirlpool surrounds Annie: it means that she can stun you."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "aurelion": {
      "id": 136,
      "difficulty": 2,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is pretty easy, just do your best to not let him poke you with his W or AAs. Most ASols will opt to push and roam, so just farm and ping him mia so your team doesn't die to his roams. You can dodge his Q with proper usage of your E and/or your Q3. When he ults you, you can ult as well and you will not be knocked back because you hit him with it.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "azir": {
      "id": 268,
      "difficulty": 6,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is Yone favored, provided you don't let him harass you for free. Take D Shield and Second Wind and lane is a lot easier. You can cancel his Ult's CC with your Q3 or your Ult. Use your W to block his Q damage. Get on top of him so he can't E away and escape. If his E collides with you, it will stop him from taking the entire E.",
      "tips": [
        "Azir relies on his soldiers to deal damage but cannot move them at will. Try to take advantage of the windows during which his soldiers are stationary.",
        "Azir does massive damage over long periods of time but lacks the powerful burst of other mages. Try to crush him fast, before he can turn the tide of the fight.",
        "Sand soldiers are like fire: don't stay in the middle."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "brand": {
      "id": 63,
      "difficulty": 2,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is really easy, provided you can dodge his Q and W. Take very short trades with him and he will never be able to full combo you. Not very many people play this champ outside of support, so you will rarely ever play against Brand mid. Don't Q3 into him or he will full combo you.",
      "tips": [
        "Brand must use a skill to initiate his combo. If you dodge Burning or Column of flames, you will interrupt its routine.",
        "Remember to get away from your allies when you see him incant Pyrolysis. The speed of the projectile is quite slow at the start, which leaves time to react.",
        "Brand's passive competence allows him to excel against the grouped teams. Don't all stay in one place.",
        "To all in Ult when brand casts his Q to make you unstoppable during animation"
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "camille": {
      "id": 164,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This champion is still very strong even after all the nerfs. She will probably take TP/Ignite. Do not stand next to walls or she will just all-in you. Stay out of her AA range when her Q2 is active. Use your W in response to her W. As long as you keep up in items/gold, you should be able to 1v1 her. Whoever hits their mythic first will take over the lane. Your E can also stop her R if you time it right. Use your E to dodge her E.",
      "tips": [
        "Camille's shield only works against one damage type at a time, so attack her when she's vulnerable to your damage.",
        "Hextech Ultimatum cast range is very short. So try to Flash to get away before Camille gets close enough."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "cassiopeia": {
      "id": 69,
      "difficulty": 8,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup depends on how good the Cass is. Do your best to dodge her Q poke. You can never Q3 into her or she will just ult you. Her W prevents you from Q3'ing, E'ing, and returning to your E. Use your E to dodge her Q if needed. She is very susceptible to ganks, so try to freeze the wave at your tower and call for jungle help. Only go on her if she misses her Q trying to harass you. Max range ulting is better than Q3'ing because she can't react to it unless she flashes.",
      "tips": [
        "If you are poisoned, beware of the potential damage Cassiopeia inflicts with Fatal Bite.",
        "Turn your back to Cassiopeia when she casts Medusa's Gaze, to be slowed rather than stunned."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "chogath": {
      "id": 31,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Tank Cho'Gath is a lot easier than AP Cho'Gath. He is very susceptible to ganks, so try to freeze the wave at your tower and call for jungle help. Always keep moving when he silences you to dodge his Q. Use your W when he Ws you. Dodge his E poke as well. If you ever see him ult, you can win the all-in. If he has ult, do not try to all-in him.",
      "tips": [
        "Buying a few HP items reduces the chance that Cho'Gath will kill you quickly.",
        "Prevent Cho'Gath from reaching its maximum size.",
        "A cloud of smoke indicates the area Rupture will hit. Stay tuned to prevent Cho'Gath from combining skills."
      ],
      "build_items": [
        "Immortal Shieldbow",
        "Blade of the Ruined King"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "corki": {
      "id": 42,
      "difficulty": 1,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly easy. His early game is pretty much non-existent. Try to bait out his W, so you can all-in him. The only way you ever lose this lane is if you let him freely harass you or do literally nothing. When he has his 'Big One' rocket, do not try to trade or all-in with him. Try to dodge it, then trade",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "darius": {
      "id": 122,
      "difficulty": 8,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "iThis matchup is incredibly hard, regardless of how well you play it. A good Darius will freeze the wave at his tower and you're unable to play the game. If you walk up, he will just Ghost, run you down, and kill you on repeat. The only chance you have of living is ulting away immediately. Don't ever let him 5 stack his passive or you're dead or very chunked. Save your E for when he uses Q to dodge the sweet spot. Take short trades against him and do your best to kite. You will never win 1v1 until you have Shieldbow.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "diana": {
      "id": 131,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is pretty even, provided you can dodge her Q harass. She is better early since she has Hextech Alternator and sorc shoes. As soon as you get shieldbow, she can never one shot you and you just take over the lane easily. Try to always go in when she misses her Q. If she hits Q, just back up.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "mundo": {
      "id": 36,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This lane is pretty easy, but it can be annoying. Dodge all of his Qs. His passive negates your Q3 as well as your R, so try to get rid of it before you ult him AND make sure you walk over the capsule that pops off when you do. You don't need to rush executioner's anymore becase you out-damage his sustain. Don't hide behind minions that are about to die; he will E them and you will take a lot of damage.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "ekko": {
      "id": 245,
      "difficulty": 3,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This lane is pretty easy. He will always E out of your Q3 and just get a massive trade on you. He's very mobile so try to catch him off guard when he's going for a cs. Always pay attention to his ult shadow and his W or you will die. Always be aware of the audio cue.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "fiora": {
      "id": 114,
      "difficulty": 8,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This lane is pretty hard. Never Q3 into her or she will just parry you and you will die. Pay attention to vitals. You can run out of her vision to get a new one if needed. Rush executioner's early game to cut down on her healing. You can bait her parry out by Q3 in a different direction from where she is. Look to fight her when her parry is down; you cannot fight her otherwise.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "fizz": {
      "id": 105,
      "difficulty": 6,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is pretty even. Save your E to dodge his E. Early null-magic mantle is good, similar to the Annie matchup so he can never 100 to 0 you. Save your W for when he Qs into you to block a big part of his burst trade. He can animation cancel his Ult with his Q, so be aware of that. Use your E to dodge his shark as well.",
      "tips": [
        "Fizz's attacks become deadly for seconds after his empowered attack. Keep him at bay when his trident shines!",
        "Fizz is elusive when his skills are not on cooldown. Push him to use them quickly, then follow up with crowd control or heavy attacks!"
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "galio": {
      "id": 3,
      "difficulty": 3,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This lane is very boring. Galio can never kill you unless he has help. His damage is just too low. The annoying part about this lane is his insane gank setup, so be very careful if you overextend and do your best to play around vision. Ping mia when he decides to roam after pushing you under tower. You can cancel his W with your E if you time it correctly.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "gangplank": {
      "id": 41,
      "difficulty": 9,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "A good GP is a nightmare for anyone. His q poke is oppressive, especially after he buys Sheen. Don't let him proc grasp for free, play safe until zerks and vamp scepter and you should be able to take over the lane fairly easily. However, once you get Shieldbow you dumpster him. Be very careful of his barrels, as they do massive damage and slow you for a while. If you go up for CS, time your W with his Q so you avoid some poke damage.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "garen": {
      "id": 86,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly annoying because of his sustain and his W. They usually take ignite and try to cheese you. When you engage on him, he'll probably use his W. If that happens, just E back and wait to trade with him. Always try to E back when he goes to Q you or you will lose trades very badly. Farm until Shiedlbow and you'll have an easier time fighting him.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "gnar": {
      "id": 150,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly annoying because of his sustain and his W. They usually take ignite and try to cheese you. When you engage on him, he'll probably use his W. If that happens, just E back and wait to trade with him. Always try to E back when he goes to Q you or you will lose trades very badly. Farm until Shiedlbow and you'll have an easier time fighting him.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "graves": {
      "id": 104,
      "difficulty": 6,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is pretty even. He will just look to push you in 24/7 so just play to scale and for farm. Do your best to not interact with him; he does a lot of damage and has a lot of burst as well as waveclear. Don't line up near a wall or his Q will 100% hit you. Make sure to keep track of his E stacks.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "gragas": {
      "id": 79,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Pretty even matchup. His poke can be oppressive if you don't dodge it. Pretty sure your Q3 cancels his E if you time it right. Do your best to dodge his Q poke and just farm/scale bc realistically u will never kill him until after zerks + zeal bc your Q CD isn't low enough to get consistent nados. Post 6 you can kill him, but just be careful bc he will ult you into his tower.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "gwen": {
      "id": 887,
      "difficulty": 3,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is pretty easy for Yone. Gwen is also a scaling champ so the lane isn't too difficult. Yone is very mobile, so you can easily dodge her empowered Q and kite out of her Ult safely. Keep in mind your R and Q3 will not hit her if you are outside of her W. Respect her level 1 as she is incredibly strong with the new Lethal Tempo.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "heimerdinger": {
      "id": 74,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Do not fight him if he has a lot of turrets out; he will chunk most of your HP. Use your E to dodge his E. Be careful using Q3 on him because he can and will just E you and you'll die. He will most likely push you under tower, so just play to farm and scale. You can only go on him when he doesn't have many turrets down and his E is on cooldown.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "illaoi": {
      "id": 420,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup can be very annoying if you can't dodge her Es. Do your best to juke with your own E and the movement speed you get from it to dodge her E and her tentacles. After she get's level 6, instantly disengage unless you know you can kill her. She is insanely strong at level 6. She doesn't really do much if you can dodge her Es however. She still does a lot of damage though. You can only win an all-in if her Ult and her E are down.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "irelia": {
      "id": 39,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is an absolute nightmare for Yone. It doesn't matter how well you play, or how bad the Irelia is. Her champ is just better. Play to survive until Shieldbow. Even then, this matchup is still very hard. If she ever freezes on you, you can't play the game. You can't walk up, similar to the Darius matchup. She will just run you down and kill you. This is my personal permaban for top lane. Do your best to dodge her E with your E. You can never fight her if her passive is stacked; you will always lose the trade/all-in.",
      "tips": [
        "Keep an eye on Irelia's Ionian Fervor stacks and attack her when she runs out.",
        "Minion waves greatly improve Irelia's mobility. Be careful when you face him in the middle of the minions.",
        "Be careful not to waste your most powerful spells on Challenge Dance."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "jax": {
      "id": 24,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly hard. Just play for short trades against him. Save your E for when he Qs onto you and Es so you can avoid the stun. Once you get Shieldbow, the lane becomes a lot easier. You will never win a stat check against him, so do your best to kite him and only fight him when you're in your E. If you ever take an extended trade with him, you will always lose because of his passive, his mixed damage, and his E.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "jayce": {
      "id": 126,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "A good Jayce is a nightmare for anyone. He will look to poke you in and out of bushes level 1, so don't take too much free damage. If you catch him off guard in the bushes however, you can actually 1v1 him level 1 and force his flash. Always be aware of his QE combo. Watch minion HP bars because he will look to surprise you with it. Do your best to farm and scale. His ult cd is 6 seconds, so take advantage of this cooldown when possible. He does a lot of damage so do your best to dodge his abilities. If you ever go for an all-in, do it when he's in cannon form. Hammer form gives him more resistances.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "karma": {
      "id": 43,
      "difficulty": 6,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is pretty easy. She will never kill you unless you get hit by everything. Her poke is very annoying early but with Doran's Shield and Second Wind it's not much of an issue. Just play to farm and scale. Don't stay in her Mantra W; she will outheal your damage and root you for a while.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "karthus": {
      "id": 30,
      "difficulty": 1,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This lane is probably one of the easiest. Rush zerks so you can dodge his Qs easier and the lane is cake. He has no CC for you. Nobody really plays this champ unless it's a one trick, so you won't play against it often.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "kassadin": {
      "id": 38,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup seems pretty easy, but a good Kassadin can make this lane exhausting. He does a lot more damage than most people expect, especially when he takes electrocute. Your Q spam will help him use his E more, so be aware of that. Do your best to space properly so he can't AA, W, Q you. At level 6, he is a lot stronger. Look to all-in him when he uses his Ult.",
      "tips": [
        "Kassadin primarily deals magic damage. In case of difficulty, buy items that improve magic resistance, such as Mercury's Sandals or Banshee's Veil.",
        "When Kassadin casts consecutive Fissures, he uses more and more mana. Think about it when you chase him.",
        "It only takes 6 spell casts for Kassadin to be able to use Pulse. If he improves this skill, beware when using spells near him."
      ],
      "build_items": [
        "Blade of the Ruined King"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "katarina": {
      "id": 55,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This lane is pretty boring because she will just roam. Do not stand on or near her daggers, or she will look to trade with you. You heavily out-sustain her. Just ping her roams because they rely on this to get fed. She will probably dodge your Q3 and Ult with her E, so try to all-in her when she doesn't have it. When you look for a trade, go on her with either Q1 or Q2; she will easily dodge your Q3.",
      "tips": [
        "Katarina's skills deal magic damage. Even if she buys items that increase her attack damage, increase your magic resistance to counter her.",
        "Try to save a hindering effect for when Katarina uses Death Lotus."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "kayle": {
      "id": 10,
      "difficulty": 1,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "There's no easier lane for Yone. Just don't fight her level 1 with Lethal Tempo because she is a lot stronger with it. You can perma all-in her whenever you want until level 6. She can't walk up to the wave early or she will get chunked. At level 6, it becomes a bit more difficult because of her range, but just get Q3s and all-in her with your E. If she ults, just E back and wait for your E to come up again and just all-in her again.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "kennen": {
      "id": 85,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is very annoying early. He will look to poke you down when you go for cs, so justdon't take free damage. Play safe and play to scale. Short trades are the most effective in this matchup. Pick up an early mantle, similar to the Annie matchup and he can never 100 to 0 you. If against Kennen mid, I would take exhaust as it hard counters his ult.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "kled": {
      "id": 240,
      "difficulty": 9,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Do your best to dodge his Qs or you will lose every trade. Do not try to trade with him when his W is active; he does a lot of damage. If you ever Q3 into him, he will just Q you and you'll lose the trade. Go for an all-in on him whenever he's unmounted; he's very immobile and won't be able to dodge your Q3 or your Ult.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Conditioning",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "leblanc": {
      "id": 7,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly hard. Not only does she shit on you 1v1, she also has really good gank setup just like Galio. Use your W when she throws Q at you. Try to freeze the wave at your tower. Play this matchup to scale. If you are even against her, you are already winning. Never Q3 into her because she will just double chain you and you'll die.",
      "tips": [
        "LeBlanc's ultimate can create copies of LeBlanc when casting spells or, more rarely, in a distant location.",
        "The copy of LeBlanc created from a distance always runs to the nearest champion, casts a harmless spell, then disappears.",
        "Attacking LeBlanc first avoids most of her tricks, especially if she just used her Distortion.",
        "Stunning or silencing LeBlanc prevents her from activating Warp Feedback."
      ],
      "build_items": [
        "Doran's Blade (Early)",
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Overgrowth",
        "Conditioning",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "lee": {
      "id": 64,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Solo lane Lee Sin isn't really a thing anymore since they nerfed it, but people still play it sometimes. Do your best to dodge his Qs. You HAVE to dodge his Es becaue they do so much damage (high base damage. Be careful once he's level 6 because his Ult is point click damage. You can rush cloth armor if their jungler and/or mid laner are ad as well. Just look to farm and scale. It's hard to kill him because he can just W away or ward hop away.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Conditioning",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "lissandra": {
      "id": 127,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This lane is pretty easy, but you can never really kill her. She plays too safe and she'll just E away if you try to fight her. She has incredible gank setup similar to Galio and Leblanc. I would take Cleanse in this matchup if you're not too confident. Opt for short trades with her. Time your E for her Ult.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "lucian": {
      "id": 236,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Lucian is very oppressive early. You cannot fight him until you have zerks and vamp scepter. Play with the goal to scale and hit your item spikes. Do your best to farm without taking too much poke or you will be susceptible to ganks/dives.",
      "tips": [
        "play passive till vampire staff and berserkers, focus on farm"
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]

    },
    "lulu": {
      "id": 117,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is easy, but annoying. Once you get vamp scepter you will out sustain her damage. Her W is very annoying regardless of the game state. Always try to E back when she Ws you so you don't take any free damage. Remember she has a lot of shields and her Ult healing. Don't get baited when you try to all-in her.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "lux": {
      "id": 99,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is annoying early, but it's still fairly easy. Always try to dodge her E and her Q or you will get chunked. Never Q3 into her or she will full combo you. Only do it if you know she's already used E and/or Q.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "malphite": {
      "id": 54,
      "difficulty": 6,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "One of the more annoying tanks because of the attack speed slow on his E and his armor early game. His poke early is very annoying, so do your best to W when he Qs. He should never be able to kill you 1v1, but at level 6 be careful of his Ult, especially if his jungler is near. You will either die or have to blow flash.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "malzahar": {
      "id": 90,
      "difficulty": 2,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is very free. You get to scale freely and he has no kill pressure on you until level 6. The only negative in this matchup is you are roped into buying a QSS. Don't rush it; instead get zerks, then vamp scepter, and then QSS into Shieldbow. You can pretty much kill him on cooldown because he's so immobile and squishy.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "maokai": {
      "id": 57,
      "difficulty": 2,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Probably the easiest tank matchup. The only way you ever die is if you overextend and he sets up a gank on you. Stay away from the brushes and he doesn't do anything to you. You can break his W and Ult with good E timing or Q3 timing.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "mordekaiser": {
      "id": 82,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is pretty easy if you can dodge his Qs. Never trade without your E because if he stays on you he will probably kill you, but even then, Lethal Tempo is just so broken right now that it probably doesn't even matter. Your E can cancel his ult with proper timing. Don't fight him when his W shield is active. Wait for it to go away, then look to re-engage.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow",
        "Blade of the Ruined King"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "morgana": {
      "id": 25,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is annoying early, but it's still fairly easy. Don't stand in her W. Never Q3 into her or she will Q you. Only do it if you know she's already used Q.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "nasus": {
      "id": 75,
      "difficulty": 3,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Win this lane by freezing at your tower. He's so immobile and incredibly easy to gank. Trade with him when he goes for stacks, as this is his only way to get damage. Any time he withers you, just disengage. The attack speed and movement speed slows are oppressive. Your trades are most effective when you have your E because of the true damage on the mark proc. At level 6, just be careful because that's when he is at his strongest. Just disengage and kite when he tries to all-in you.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow",
        "Executiononers Calling"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Unflinching",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "neeko": {
      "id": 518,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is annoying as hell. You can never Q3 into her or she will just E you and full combo you. E back when she channels her ult. If you get hit by her Es at all, prepare to lose lane or most of your HP. Use your ult after she uses her W so you have vision of her. If you hit her when she uses W while you're in your E, the E mark will show the real neeko. Don't let her poke you for free with her autos and her W passive.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "orianna": {
      "id": 61,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Probably the most even matchup for Yone. Her poke is very annoying early, but she's very immobile. Don't let her auto or poke you for free and this lane is a lot easier for you. She's decently tanky because of her E passive when her ball is on her. Look for a trade or an all-in when her ball is not on her or when she uses Q and/or W. You start winning at zerks and vamp scepter.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "ornn": {
      "id": 516,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "One of the easier tank matchups. You get to scale for free because he does no damage. Just do you best to dodge his Qs and don't stay near his Q or walls because of his E. Don't let him W auto you and this lane is free. You can E to dodge his ult if you time it correctly. Save your E for when he Ws you; you will go behind him and he won't get the brittle on you.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "pantheon": {
      "id": 80,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is impossible early game unless he misplays. His kit just counters yours. You have no way to trade with him because of his E. He can just full combo you on repeat and you have no way to react or outplay it. You have to play super safe in this lane or you will die over and over. Do not walk up when he has his passive fully stacked. You really only have a chance after you get Shieldbow, but even then, his champ is just better early game. Play with the goal to scale. Use your W when he Qs or Ws you to dodge some of the damage. You can E his W if you time it correctly.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "poppy": {
      "id": 78,
      "difficulty": 8,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is very hard if she's good. She has really high base damages and her W counters your entire kit. If you Q3 or E into her, you'll be grounded for a while and she can just out trade you. Try to step on her passive when she uses it to farm. Do NOT go near walls for any reason or you will die/get chunked. If she uses her passive on you, just W the damage. At Shieldbow, this lane is a bit easier, but Poppy is still Poppy.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "qiyana": {
      "id": 246,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is annoying because of her stealth and mobility. Early cloth armor is good here so she can't 100 to 0 you. Do your best to dodge her Qs. You can dodge her ult with your E or ult. She can really punish your positioning; don't stand near walls or you'll die or get really chunked. Ping her when she's mia because she loves to roam. Be careful in river because her ult will also stun you there.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "quinn": {
      "id": 133,
      "difficulty": 7,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is only annoying early because of her range. You can't E into her or she will just E you in return. Instead, you should E into Q3. Don't let her poke you for free and give up cs when necessary, but do your best to stay in xp range. You outscale her at Shieldbow, so just do your best to farm for it.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "renekton": {
      "id": 58,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is impossible to win 1v1 just because his kit counters yours. Early tabis is a must. The only window you have to beat him early is at level 1 and level 2; he is incredibly weak at this point. After that, you can't trade with him unless he misplays. Be extra careful if he goes Prowler's because he will 100 to 0 you even through tabis. At level 6, you still can't fight him, so just do your best to not die on repeat.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "rengar": {
      "id": 107,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is just as unplayable as the Irelia matchup, but he is susceptible to ganks. That's his only weakness. Rush early cloth armor or you will get one shot over and over. You will never have prio early, so give up cs and let the wave push into you. Call your jungler to help you push the wave to his tower or you will never break his freeze. Do your best to survive and not die 100 times during laning phase and group with your team later on. Giving up 50cs and dying less is a lot better than contesting every cs but dying 10 times.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "riven": {
      "id": 92,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is a nightmare and it's totally in Riven's control. Her champ is just better. She can just perma engage on you, perma cc you, and 100 to 0 you with Conq. Do your best to farm and scale. At level 6, if you mis-step or use your E incorrectly, you just die. She just permanently stat checks you.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "rumble": {
      "id": 68,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is very hard. He can miss everything and still kill you because of how his heat works. Do your best to dodge his Es because they give him more magic pen. Don't fight him when he uses Q or you will always lose the trade. Ping him mia because Rumbles love to roam. He just does way too much damage for Yone to handle. Do NOT fight him when he's overheated; his autos will outdamage yours.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "ryze": {
      "id": 13,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "He is very annoying early game. He just hard pushes you in. This matchup is a lot easier with Lethal Tempo, but he still does a decent amount of damage. Don't let him harass you for free. Don't stand near the wave when he EQs or you will get hit too. You can kill him at level 6 if he mis-steps or overstays. If he tries to Ult away, Q3 or ult him and his ult will be cancelled.",
      "tips": [
        "Ryze is particularly dangerous against opponents marked by Flux.",
        "Take advantage of the Warp Portal's activation time to decide how to deal with what may come out of it.",
        "Inflicting crowd control on Ryze while Dimensional Portal is active will cancel the portal."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "seraphine": {
      "id": 147,
      "difficulty": 1,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is free. You get to scale, she has no kill pressure unless you try to get hit by everything. You roll her at Shieldbow so just farm until then. She plays super far back, so just focus on cs instead of trying to kill her. She can be annoying because of her sustain, shields, and her movement speed.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "sett": {
      "id": 875,
      "difficulty": 9,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is pretty hard. Don't walk up near your minions or he will E and stun you and out-trade you. He out sustains you as well because of his passive. Save your E to dodge his W. He just stat checks you all game, so you'll probably never win 1v1 unless you outplay him. Lane is a bit easier after Shieldbow, but Sett is Sett.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow",
        "Blade of the Ruined King"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "shen": {
      "id": 98,
      "difficulty": 8,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is hard. Try to dodge his E with yours. Don't fight him in his W. Just play to scale. This lane is a lot easier after Shieldbow. Ping him when he's 6 and try to keep track of his ult cd. Don't walk between him and his sword, because if it goes through you, he will slow you and do more damage.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow",
        "Blade of the Ruined King"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "singed": {
      "id": 27,
      "difficulty": 2,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Rule #1 of League of Legends: Don't chase Singed. You can kill him level 1 because of Lethal Tempo. His W counters your Q3 and your E, so just try not to fight him when he uses it. Whenever he ults, just disengage; he gets so many free stats and it's not worth your time or damage to fight him. Lane is very easy after Shieldbow.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow",
        "Blade of the Ruined King"
      ],
      "rune_suggestions": [
        "Conditioning",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "sion": {
      "id": 14,
      "difficulty": 2,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly easy. He has such long cooldowns early so just abuse that. Later on in the lane, it's more annoying because of how tanky he gets, but his abilities are so telegraphed; he should never kill you. Respect bushes and don't let him fully charge Q on you. You can break his W before it charges to block its damage. You can perma all-in with E; the true damage from the mark will help with trades.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "sylas": {
      "id": 517,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is annoying because of his sustain and burst. You can't Q3 into him or he will just E you. Rush vamp scepter to match his sustain. You have to dodge his Qs, especially the 2nd part. Don't take extended trades with him. Hide in between minions so he can't hit you with the second part of his E. Mortal Reminder is a good 2nd item, especially if the enemy team has more healing.",
      "tips": ["https://www.youtube.com/watch?v=hUXQvHYECnE"],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "syndra": {
      "id": 134,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is one of the more annoying mage matchups. She will Q you whenever you go for cs. When you E, she will just E you in return. To counter this, try to be more erratic with your movement to dodge it. You can only all-in or trade with her if she misses her E. Early mantle is good so she can't 100 to 0 you when she hits level 6. Play to scale and set up ganks with your jungler because she's very immobile.",
      "tips": [
        "Quickly grab boots when playing against Syndra, they will help you avoid many of her spells.",
        "Attack Syndra after she uses Scatter the Weak. Her recovery time is long and she will be vulnerable.",
        "At max rank, Syndra's spells gain bonus effects and change appearance."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "tahm": {
      "id": 223,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Yone is actually very good against him because he is very mobile. You can dodge his W with your E. Just do your best to dodge his Qs or you'll lose the way very easily. You can practically scale and farm in this matchup. Just respect his level 1. The path is much easier after Shieldbow, but he will still give you a stat check. Try not to process your E before his shield deactivates. Try to save your Q3 for the end of your E in case he tries to W you when you get back to it.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "talon": {
      "id": 91,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is pretty easy. Just respect his level 2 powerspike. Don't let him land both parts of his W or you will lose a lot of HP. Pick up an early cloth armor if you think you need it. When he Ws, you can E behind him and dodge the 2nd part; he can't proc his passive if you do this. At level 6, it's a bit harder. But the way you play it remains the same.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "teemo": {
      "id": 17,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Since the buff to his Q, this matchup is a lot harder. Do not fight him early because of his poison. Play to scale; don't worry about trading with him early. He will out-trade you with Q. Once you get Shieldbow, the lane is a lot easier, however. Get Red Trinket around level 6 so you don't hit his shrooms.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "tristana": {
      "id": 18,
      "difficulty": 10,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This lane is impossible early. If you walk up, she just E Ws you and you die or blow flash. Play super safe early and give up cs, but try to stay in xp range. If she Ws onto you, try to E into her to dodge the damage and the slow, stack your Q3 on the wave, E back, and Q3 to safety. Exhaust is a must in matchup. The lane is a lot easier the more you scale, so just do your best to farm.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "trundle": {
      "id": 48,
      "difficulty": 6,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Don't try to fight him level 1. His Q steals your AD, and if he takes Lethal Tempo, you will not win it. I feel like you can just perma jump on him with E until 6. After he has his Ult, do NOT try to fight him bc he will steal your armor/mr so just do your best to kite out of it + his pillar. You can beat him in the side lane later on if you are fed enough. If they have a lot of healing in their comp, executioner's / mortal reminder is extremely valuable.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "tryndamere": {
      "id": 23,
      "difficulty": 4,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is annoying but it's Yone favored. He out sustains you. He is a lot stronger than you early with Lethal Tempo, so respect that. When he Es onto you, E into the wave, stack Q3, return to your E, and Q3 out. Do your best to kite him. You can take ignite in this matchup to win the level 1, but if you die, your lane is over.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "twisted_fate": {
      "id": 4,
      "difficulty": 6,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is Twisted Fate favored to a degree. Trade or all-in him when he uses his W. Do your best to dodge his Qs. He will just look to push and roam, so ping him mia when he does. You can cleanse his Gold Card with proper timing on your E.",
      "tips": [
        "Trade or all in him when he uses his W",
        "Do your best to dodge his Q's",
        "Use E to dodge his E",
        "Twisted Fate controls the early game, farm and scale",
        "Be very wary of his roaming and ping MIA"
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "urgot": {
      "id": 6,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Use your E to dodge his E. If you ever get hit by his E, you either die or have to blow flash. He completely controls the lane early game, so just do your best to farm and scale. The lane is super easy after Shieldbow as long as you can dodge his E.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
        "Overgrowth",
        "Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "vayne": {
      "id": 67,
      "difficulty": 8,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This lane is similar to Akshan or Lucian. You can't walk up for cs or you'll just get chunked. Do your best to stay in xp range while giving up cs. You can't really trade with her until Shieldbow, but even then her mobility is obnoxious. Don't ever let her proc her W on you. She is very squishy, so once you get on her, you should be able to kill her. If you E or Q3 her, she will just E you away. Don't ever go near a wall or she will E you into the wall and you will probably die.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "veigar": {
      "id": 45,
      "difficulty": 2,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is incredibly easy. You get to free farm and scale. Do your best to dodge his Q and W. The only real threat he has is his cage, especially if and when you get ganked. Your E will stop the stun, but you will be stunned when you return back. If you're in the cage, you can ult out of it since you're unstoppable. Try to deny him his stacks, but don't overplay the trade.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
	"Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "velkoz": {
      "id": 161,
      "difficulty": 2,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "Relatively easy matchup as long as you can dodge his kit. Stay out of the wave when he Ws. You can dodge his Q and E with your E. When he uses his abilities on the wave, then you can look for a trade or an all-in. He should be pretty easy to kill after level 6 since he's immobile.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
	"Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "vex": {
      "id": 711,
      "difficulty": 10,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "This matchup is a nightmare early. Her kit just counters yours. Her passive will fear you out of your Q3 and your E. Go on her when she uses her spells to wave clear and when her passive is on cooldown. You can't fight her when her passive is active. Early null magic mantle similar to Annie or Fizz will prevent her from oneshotting you with her full combo at level 6.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
	"Unflinching",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Teleport"
      ]
    },
    "viktor": {
      "id": 112,
      "difficulty": 5,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Pretty much a farm lane. Just don't take too much poke from him and you're fine. He will look to push you in when he gets his E augment. Use your W to shield some of his Q poke. If you ever Q3 or E onto him, he will just W, so E out. At level 6, it's a bit easier, but he does a lot of damage so try to trade or all-in when he uses Q or E.",
      "tips": [
        "Be careful if you let Viktor approach you. The closer he is to his opponent, the more his control over the battlefield increases.",
        "To know the number of improvements obtained by Viktor, look at the color of the light on his staff (purple, yellow, blue, red)."
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "vladimir": {
      "id": 8,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "A good Vlad can make this lane hell, especially if he goes electrocute. However, Lethal Tempo makes this matchup a lot easier. You can perma engage on him, but do not walk up or try to trade with him when he has his empowered Q. You can put extra points in your E since his W cooldown is so long. Executioner's isn't really needed since you'll most likely take ignite. Early null mantle if you're behind is fine, too.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind",
        "Overgrowth",
        "Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "volibear": {
      "id": 106,
      "difficulty": 10,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Very tough lane. Take short trades against him and kite him out. If he Ws you, you have to back off or you will take a lot of damage and he will get healed. W him when he goes to Q you. Use your E to kite him. Be careful at level 6 because he can dive you.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "warwick": {
      "id": 19,
      "difficulty": 5,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "wukong": {
      "id": 62,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is near impossible because he is just bruiser Malphite. He will auto you and get armor because of his passive. W when he Es onto you to block some of the damage. Early ninja tabi is really good into Wukong because all of his damage is basic attacks. If he ults you, try to kite out of it with E and Q. Just try to freeze the wave near your tower if you can.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
	"Overgrowth",
	"Armor"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "xerath": {
      "id": 101,
      "difficulty": 2,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "Just dodge his poke and this lane is incredibly easy. If you freeze the wave at your tower, he is forced to walk up. He is very vulnerable to ganks and super immobile. Use your E to dodge his Q, W, and ults. If you ever Q3 or E at him, he will just E you. At level 6, you can just ult him and he can't do much.",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Conditioning",
	"Overgrowth",
	"Magic Resist"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "yasuo": {
      "id": 157,
      "difficulty": 6,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "He's much stronger up to level 3. Don't take too much damage at first and you'll be fine. He will seek to block your Q3. You can always eliminate his passive. Try not to fight in the wave of minions because it will E over and over again. This matchup is purely a skill matchup after level 3.",
      "tips": [
        "Steel Storm is not very wide. Move sideways to try to dodge it.",
        "When Yasuo places two Steel Storms in a row, the next one will trigger a tornado. Watch for the sound that announces this effect and get ready to dodge.",
        "Yasuo is less dangerous after firing a tornado. Attack then.",
        "Shield of Determination lasts 2 sec. Inflicting damage on Yasuo triggers the shield: attack when it disappears."
      ],
      "build_items": [
        "Immortal Shieldbow",
        "Infinity Edge",
        "Death's Dance"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "yone": {
      "id": 777,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "zed": {
      "id": 238,
      "difficulty": 10,
      "start_items": [
        "Doran's Blade",
        "Potion"
      ],
      "strategy": "This matchup is a nightmare if the Zed is good. You have to save your E for when he uses W or you'll have trouble dodging anything. You absolutely have to take the escape against Zed or you will die repeatedly. At level 6, you have to play incredibly safe since you have no evasion ability. Grab early cloth armor and steelcaps if their jungler is also AD. You can't Q3 or ultramarine it unless its W and R are on the cooldown because it will dodge them and kill you. Take the exhaust.",
      "tips": [
        "Zed benefits from attack damage items he buys; the armor is therefore very effective against him.",
        "After using Living Shadow, Zed is vulnerable because his damage, slows, and mobility rely on this skill.",
        "Shadow Slash can only slow you down if Zed's shadow hits you with this skill.",
        "You can use E to dodge his W > E > Q poke",
        "Early cloth armor is a must"
      ],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Bone Plating",
        "Overgrowth"
      ],
      "summoner_spells": [
        "Flash",
        "Exhaust"
      ]
    },
    "ziggs": {
      "id": 115,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    },
    "zoe": {
      "id": 142,
      "difficulty": 4,
      "start_items": [
        "Doran's Shield",
        "Potion"
      ],
      "strategy": "",
      "tips": [],
      "build_items": [
        "Immortal Shieldbow"
      ],
      "rune_suggestions": [
        "Second Wind"
      ],
      "summoner_spells": [
        "Flash",
        "Ignite"
      ]
    }
  }
}
